In [1]:
products={}
products['pid']=[101,102,103]
products['pname']=['pA','pB','pC']
products['pcost']=[1000,2000,3000]

products['pid'].append(104)
products['pname'].append('pD')
products['pcost'].append(4000)


products['pid'].append(105)
products['pname'].append('pE')
products['pcost'].append(5000)

products['pid'].append(106)
products['pname'].append('pF')
products['pcost'].append(6000)


products['pid'].append(107)
products['pname'].append('pG')
products['pcost'].append(7000)

products['pid'].append(108)
products['pname'].append('pF')
products['pcost'].append(8000)
products

{'pid': [101, 102, 103, 104, 105, 106, 107, 108],
 'pname': ['pA', 'pB', 'pC', 'pD', 'pE', 'pF', 'pG', 'pF'],
 'pcost': [1000, 2000, 3000, 4000, 5000, 6000, 7000, 8000]}

In [2]:
import numpy as np
import pandas as pd

In [3]:
df1 = pd.DataFrame(products)
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   pid     8 non-null      int64
 1   pname   8 non-null      object
 2   pcost   8 non-null      int64
dtypes: int64(2), object(1)
memory usage: 324.0+ bytes

In [4]:
df1.loc[2:4][['pname','pcost']]

  pname  pcost
2    pC   3000
3    pD   4000
4    pE   5000

In [5]:
df1.drop(columns='pcost')

   pid pname
0  101    pA
1  102    pB
2  103    pC
3  104    pD
4  105    pE
5  106    pF
6  107    pG
7  108    pF

In [6]:
df1.drop(columns=['pcost','pname'])

   pid
0  101
1  102
2  103
3  104
4  105
5  106
6  107
7  108

In [7]:
df1

   pid pname  pcost
0  101    pA   1000
1  102    pB   2000
2  103    pC   3000
3  104    pD   4000
4  105    pE   5000
5  106    pF   6000
6  107    pG   7000
7  108    pF   8000

In [8]:
## rename columns
#----------------
# df.rename({'oldColumnName':'newColumn'})
d={'K1':[1,2,3],'K2':[4,3,1],'Field 3':[10,20,30]}

df2 = pd.DataFrame(d)
df2.columns

Index(['K1', 'K2', 'Field 3'], dtype='object')

In [9]:
df2.rename(columns={'Field 3':'K3'})

   K1  K2  K3
0   1   4  10
1   2   3  20
2   3   1  30

In [10]:
df2.rename(columns={'Field 3':'K3'},inplace=True)

In [11]:
df2.columns

Index(['K1', 'K2', 'K3'], dtype='object')

In [12]:
## Null value - missing values ->NaN 
d={}
d['K1'] = [10,20,None]
d['K2'] = [15,None,None]
d['K3'] = [None,11,None]
pd.DataFrame(d)

     K1    K2    K3
0  10.0  15.0   NaN
1  20.0   NaN  11.0
2   NaN   NaN   NaN

In [14]:
df3 = pd.DataFrame(d)
df3.info()
df3.isnull()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   K1      2 non-null      float64
 1   K2      1 non-null      float64
 2   K3      1 non-null      float64
dtypes: float64(3)
memory usage: 204.0 bytes

      K1     K2     K3
0  False  False   True
1  False   True  False
2   True   True   True

In [15]:
df3.isnull().sum()

K1    1
K2    2
K3    2
dtype: int64

In [16]:
# To replace NaN Value => fillna(<replacementValue>)
df3.fillna('TestData')

         K1        K2        K3
0      10.0      15.0  TestData
1      20.0  TestData      11.0
2  TestData  TestData  TestData

In [17]:
df3.fillna(45)

     K1    K2    K3
0  10.0  15.0  45.0
1  20.0  45.0  11.0
2  45.0  45.0  45.0

In [18]:
df3

     K1    K2    K3
0  10.0  15.0   NaN
1  20.0   NaN  11.0
2   NaN   NaN   NaN

In [19]:
df3['K1']

0    10.0
1    20.0
2     NaN
Name: K1, dtype: float64

In [20]:
df3['K1'].fillna(44)

0    10.0
1    20.0
2    44.0
Name: K1, dtype: float64

In [21]:
df3[['K2','K3']].fillna(56.31)

      K2     K3
0  15.00  56.31
1  56.31  11.00
2  56.31  56.31

In [22]:
df3.fillna(56.31,inplace=True)

In [23]:
df3.isnull().sum()

K1    0
K2    0
K3    0
dtype: int64

In [24]:
## duplicate data
df3.duplicated()

0    False
1    False
2    False
dtype: bool

In [25]:
print(df3.duplicated().sum())

0

In [26]:
d={'K1':[10,10,30],'K2':[10,10,30],'K3':[10,10,30]}
df4 = pd.DataFrame(d)
df4.duplicated().sum()

np.int64(1)

In [28]:
df4.duplicated()

0    False
1     True
2    False
dtype: bool

In [29]:
df4.drop_duplicates()

   K1  K2  K3
0  10  10  10
2  30  30  30

In [30]:
df4

   K1  K2  K3
0  10  10  10
1  10  10  10
2  30  30  30

In [31]:
# df.at[row,colum]='update_value'

df4.loc[1]['K2']

np.int64(10)

In [32]:
df4.at[1,'K2'] = 3456.23

C:\Users\karth\AppData\Local\Temp\ipykernel_1536\3143748350.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '3456.23' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df4.at[1,'K2'] = 3456.23

In [33]:
df4

   K1       K2  K3
0  10    10.00  10
1  10  3456.23  10
2  30    30.00  30

In [34]:
## Write DataFrame to FILE => df.to_csv(resultFile)
df4.to_csv('test1.csv')

In [36]:
pd.read_csv('emp.csv')  Vs pd.DataFrame(<datastructure>)

   eid    ename  edept    ecity  ecost
0  101      raj  sales     pune   1000
1  102      leo   prod   bglore   2301
2  230      raj   prod     pune   2300
3  450     shan  sales   bglore   3401
4  542      anu     HR   mumbai   4590
5  321     bibu  sales      hyd   5419
6  651      ram     hr   bglore   3130
7  541      leo  admin  chennai   4913
8  652  karthik  sales   bglore   3405

In [37]:
# df4.to_csv('test1.csv')
pd.read_csv('test1.csv')

   Unnamed: 0  K1       K2  K3
0           0  10    10.00  10
1           1  10  3456.23  10
2           2  30    30.00  30

In [38]:
df4.to_csv('test1.csv',index=False)
pd.read_csv('test1.csv')

   K1       K2  K3
0  10    10.00  10
1  10  3456.23  10
2  30    30.00  30

In [39]:
# 1. load the data ->dataframe
df_csv = pd.read_csv('emp.csv')
# 2. Get information about the data
df_csv.info()
# 3. List of row index and columns 
print(df_csv.index)
print(df_csv.columns)
# 4. display shape of the data -> Row X Col
print(df_csv.shape)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   eid     9 non-null      int64
 1   ename   9 non-null      object
 2   edept   9 non-null      object
 3   ecity   9 non-null      object
 4   ecost   9 non-null      int64
dtypes: int64(2), object(3)
memory usage: 492.0+ bytes
RangeIndex(start=0, stop=9, step=1)
Index(['eid', 'ename', 'edept', 'ecity', 'ecost'], dtype='object')
(9, 5)

In [41]:
df3.to_csv('test1.log',sep=":")

In [42]:
pd.read_csv('test1.log')

             :K1:K2:K3
0    0:10.0:15.0:56.31
1    1:20.0:56.31:11.0
2  2:56.31:56.31:56.31

In [43]:
pd.read_csv('test1.log',sep=':')

   Unnamed: 0     K1     K2     K3
0           0  10.00  15.00  56.31
1           1  20.00  56.31  11.00
2           2  56.31  56.31  56.31

In [44]:
# Test - anyduplicated values are exists
df_csv.duplicated().sum()

np.int64(0)

In [45]:
df_csv.drop_duplicates(inplace=True)

In [46]:
df_csv.columns

Index(['eid', 'ename', 'edept', 'ecity', 'ecost'], dtype='object')

In [48]:
df_csv.rename(columns={'edept':'EDEPT','ecost':'Amount'},inplace=True)

In [49]:
df_csv

   eid    ename  EDEPT    ecity  Amount
0  101      raj  sales     pune    1000
1  102      leo   prod   bglore    2301
2  230      raj   prod     pune    2300
3  450     shan  sales   bglore    3401
4  542      anu     HR   mumbai    4590
5  321     bibu  sales      hyd    5419
6  651      ram     hr   bglore    3130
7  541      leo  admin  chennai    4913
8  652  karthik  sales   bglore    3405

In [51]:
len(df_csv.index)

9

In [52]:
for var in range(1,len(df_csv.index)+1):
    print(var,end=' ')

1 2 3 4 5 6 7 8 9

In [53]:
df_csv.index=[var for var in range(1,len(df_csv.index)+1)]

In [54]:
df_csv.index

Index([1, 2, 3, 4, 5, 6, 7, 8, 9], dtype='int64')

In [55]:
df_csv

   eid    ename  EDEPT    ecity  Amount
1  101      raj  sales     pune    1000
2  102      leo   prod   bglore    2301
3  230      raj   prod     pune    2300
4  450     shan  sales   bglore    3401
5  542      anu     HR   mumbai    4590
6  321     bibu  sales      hyd    5419
7  651      ram     hr   bglore    3130
8  541      leo  admin  chennai    4913
9  652  karthik  sales   bglore    3405

In [56]:
df_csv.sort_index()

   eid    ename  EDEPT    ecity  Amount
1  101      raj  sales     pune    1000
2  102      leo   prod   bglore    2301
3  230      raj   prod     pune    2300
4  450     shan  sales   bglore    3401
5  542      anu     HR   mumbai    4590
6  321     bibu  sales      hyd    5419
7  651      ram     hr   bglore    3130
8  541      leo  admin  chennai    4913
9  652  karthik  sales   bglore    3405

In [57]:
df_csv.sort_index(ascending=False)

   eid    ename  EDEPT    ecity  Amount
9  652  karthik  sales   bglore    3405
8  541      leo  admin  chennai    4913
7  651      ram     hr   bglore    3130
6  321     bibu  sales      hyd    5419
5  542      anu     HR   mumbai    4590
4  450     shan  sales   bglore    3401
3  230      raj   prod     pune    2300
2  102      leo   prod   bglore    2301
1  101      raj  sales     pune    1000

In [58]:
df_csv.sort_values(by='ecity')

   eid    ename  EDEPT    ecity  Amount
2  102      leo   prod   bglore    2301
4  450     shan  sales   bglore    3401
7  651      ram     hr   bglore    3130
9  652  karthik  sales   bglore    3405
8  541      leo  admin  chennai    4913
6  321     bibu  sales      hyd    5419
5  542      anu     HR   mumbai    4590
1  101      raj  sales     pune    1000
3  230      raj   prod     pune    2300

In [ ]:
Data Aggregation
================
Rage of data //array ----->------scalar data(single)

np.max([1,1,23,145,4323433,34]) ---> 4323433

np.max()
np.min()
np.mean()
np.sum()
..
df.groupby('field').sum()|max()|min()|mean()|count()....

In [59]:
products = {'pnames':['pA','pB','pA','pC','pB','pD'],
            'sales':[100,200,140,120,110,120]}

df = pd.DataFrame(products)
df.groupby('pnames').sum()

        sales
pnames
pA        240
pB        310
pC        120
pD        120

In [60]:
df.groupby('pnames').min()

        sales
pnames
pA        100
pB        110
pC        120
pD        120

In [61]:
df.groupby('pnames').agg(['min','max'])

       sales
         min  max
pnames
pA       100  140
pB       110  200
pC       120  120
pD       120  120